In [74]:
import pandas as pd

In [75]:
pd.__version__

'2.0.1'

In [76]:
my_details={
    'name':['Uday Vikram Singh','Anubhav Yadav','Prakhar Nigam','Anand Kumar','Ravi Mishra'],
    'age':[20,21,21,23,21],
    'Degree':['B.Tech(CSE)','B.Tech(Chemical)','B.Tech(Cyber Security)','B.Arch','Nursing'],
    'College':['SRMCEM','IET','Chandigarh University','SDCA',None],
    'Location':['Lucknow','Lucknow','Chandigarh','Ghaziabad','Lucknow'],
}

In [77]:
print(my_details)

{'name': ['Uday Vikram Singh', 'Anubhav Yadav', 'Prakhar Nigam', 'Anand Kumar', 'Ravi Mishra'], 'age': [20, 21, 21, 23, 21], 'Degree': ['B.Tech(CSE)', 'B.Tech(Chemical)', 'B.Tech(Cyber Security)', 'B.Arch', 'Nursing'], 'College': ['SRMCEM', 'IET', 'Chandigarh University', 'SDCA', None], 'Location': ['Lucknow', 'Lucknow', 'Chandigarh', 'Ghaziabad', 'Lucknow']}

In [78]:
my_df=pd.DataFrame(my_details,index=('A','B','C','D','E'))
print(my_df)

                name  age                  Degree                College
A  Uday Vikram Singh   20             B.Tech(CSE)                 SRMCEM  \
B      Anubhav Yadav   21        B.Tech(Chemical)                    IET
C      Prakhar Nigam   21  B.Tech(Cyber Security)  Chandigarh University
D        Anand Kumar   23                  B.Arch                   SDCA
E        Ravi Mishra   21                 Nursing                   None

     Location
A     Lucknow
B     Lucknow
C  Chandigarh
D   Ghaziabad
E     Lucknow

# Data Access

In [79]:
my_df.head() # first five rows

,name,age,Degree,College,Location
A,Uday Vikram Singh,20,B.Tech(CSE),SRMCEM,Lucknow
B,Anubhav Yadav,21,B.Tech(Chemical),IET,Lucknow
C,Prakhar Nigam,21,B.Tech(Cyber Security),Chandigarh University,Chandigarh
D,Anand Kumar,23,B.Arch,SDCA,Ghaziabad
E,Ravi Mishra,21,Nursing,None,Lucknow

In [80]:
my_df.tail() # last five columns

,name,age,Degree,College,Location
A,Uday Vikram Singh,20,B.Tech(CSE),SRMCEM,Lucknow
B,Anubhav Yadav,21,B.Tech(Chemical),IET,Lucknow
C,Prakhar Nigam,21,B.Tech(Cyber Security),Chandigarh University,Chandigarh
D,Anand Kumar,23,B.Arch,SDCA,Ghaziabad
E,Ravi Mishra,21,Nursing,None,Lucknow

In [81]:
my_df.index # it is a series of labels that identify each row, used for label-based access and alignments

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [82]:
my_df

,name,age,Degree,College,Location
A,Uday Vikram Singh,20,B.Tech(CSE),SRMCEM,Lucknow
B,Anubhav Yadav,21,B.Tech(Chemical),IET,Lucknow
C,Prakhar Nigam,21,B.Tech(Cyber Security),Chandigarh University,Chandigarh
D,Anand Kumar,23,B.Arch,SDCA,Ghaziabad
E,Ravi Mishra,21,Nursing,None,Lucknow

In [83]:
my_df.index=['a','b','c','d','e']

In [84]:
my_df

,name,age,Degree,College,Location
a,Uday Vikram Singh,20,B.Tech(CSE),SRMCEM,Lucknow
b,Anubhav Yadav,21,B.Tech(Chemical),IET,Lucknow
c,Prakhar Nigam,21,B.Tech(Cyber Security),Chandigarh University,Chandigarh
d,Anand Kumar,23,B.Arch,SDCA,Ghaziabad
e,Ravi Mishra,21,Nursing,None,Lucknow

In [85]:
# accessing information using index
my_df.loc['e']

name        Ravi Mishra
age                  21
Degree          Nursing
College            None
Location        Lucknow
Name: e, dtype: object

# Data Cleaning

In [86]:
my_df.isnull() # used for checking missing values, checks whether value is null or not, True on e's college

    name    age  Degree  College  Location
a  False  False   False    False     False
b  False  False   False    False     False
c  False  False   False    False     False
d  False  False   False    False     False
e  False  False   False     True     False

In [87]:
my_df.notnull() # used for checking missing values, check whether value is not null or not, False on e's college

   name   age  Degree  College  Location
a  True  True    True     True      True
b  True  True    True     True      True
c  True  True    True     True      True
d  True  True    True     True      True
e  True  True    True    False      True

In [88]:
my_df.notna() # used for checking missing values

   name   age  Degree  College  Location
a  True  True    True     True      True
b  True  True    True     True      True
c  True  True    True     True      True
d  True  True    True     True      True
e  True  True    True    False      True

In [89]:
my_df.dropna() # Removes row with missing values, by default axis=0 --> rows

,name,age,Degree,College,Location
a,Uday Vikram Singh,20,B.Tech(CSE),SRMCEM,Lucknow
b,Anubhav Yadav,21,B.Tech(Chemical),IET,Lucknow
c,Prakhar Nigam,21,B.Tech(Cyber Security),Chandigarh University,Chandigarh
d,Anand Kumar,23,B.Arch,SDCA,Ghaziabad

In [90]:
my_df.dropna(axis=1) # On using axis=1 Removes column with missing values
# my_df.dropna(axis=1,inplace=True) # On using inplace=True changes are reflected in Original Dataframe too

                name  age                  Degree    Location
a  Uday Vikram Singh   20             B.Tech(CSE)     Lucknow
b      Anubhav Yadav   21        B.Tech(Chemical)     Lucknow
c      Prakhar Nigam   21  B.Tech(Cyber Security)  Chandigarh
d        Anand Kumar   23                  B.Arch   Ghaziabad
e        Ravi Mishra   21                 Nursing     Lucknow

In [91]:
my_df

,name,age,Degree,College,Location
a,Uday Vikram Singh,20,B.Tech(CSE),SRMCEM,Lucknow
b,Anubhav Yadav,21,B.Tech(Chemical),IET,Lucknow
c,Prakhar Nigam,21,B.Tech(Cyber Security),Chandigarh University,Chandigarh
d,Anand Kumar,23,B.Arch,SDCA,Ghaziabad
e,Ravi Mishra,21,Nursing,None,Lucknow

In [92]:
my_df.fillna('Integral University',inplace=True) # replace missing values with specified values

In [93]:
my_df

,name,age,Degree,College,Location
a,Uday Vikram Singh,20,B.Tech(CSE),SRMCEM,Lucknow
b,Anubhav Yadav,21,B.Tech(Chemical),IET,Lucknow
c,Prakhar Nigam,21,B.Tech(Cyber Security),Chandigarh University,Chandigarh
d,Anand Kumar,23,B.Arch,SDCA,Ghaziabad
e,Ravi Mishra,21,Nursing,Integral University,Lucknow

In [94]:
my_df.duplicated() # return a boolean series indicating whether each row in dataframe is duplicated or not .

a    False
b    False
c    False
d    False
e    False
dtype: bool

In [95]:
my_df

,name,age,Degree,College,Location
a,Uday Vikram Singh,20,B.Tech(CSE),SRMCEM,Lucknow
b,Anubhav Yadav,21,B.Tech(Chemical),IET,Lucknow
c,Prakhar Nigam,21,B.Tech(Cyber Security),Chandigarh University,Chandigarh
d,Anand Kumar,23,B.Arch,SDCA,Ghaziabad
e,Ravi Mishra,21,Nursing,Integral University,Lucknow

In [97]:
my_df.drop_duplicates() # removes duplicate rows from the dataframe

,name,age,Degree,College,Location
a,Uday Vikram Singh,20,B.Tech(CSE),SRMCEM,Lucknow
b,Anubhav Yadav,21,B.Tech(Chemical),IET,Lucknow
c,Prakhar Nigam,21,B.Tech(Cyber Security),Chandigarh University,Chandigarh
d,Anand Kumar,23,B.Arch,SDCA,Ghaziabad
e,Ravi Mishra,21,Nursing,Integral University,Lucknow

# Data Selection and Indexing

In [105]:
# Selection by Label
print(my_df.loc['a'])
print(my_df.loc['c'])

name        Uday Vikram Singh
age                        20
Degree            B.Tech(CSE)
College                SRMCEM
Location              Lucknow
Name: a, dtype: object
name                 Prakhar Nigam
age                             21
Degree      B.Tech(Cyber Security)
College      Chandigarh University
Location                Chandigarh
Name: c, dtype: object

In [106]:
# Selection By position
print(my_df.iloc[0])
print(my_df.iloc[1])
print(my_df.iloc[4])

name        Uday Vikram Singh
age                        20
Degree            B.Tech(CSE)
College                SRMCEM
Location              Lucknow
Name: a, dtype: object
name           Anubhav Yadav
age                       21
Degree      B.Tech(Chemical)
College                  IET
Location             Lucknow
Name: b, dtype: object
name                Ravi Mishra
age                          21
Degree                  Nursing
College     Integral University
Location                Lucknow
Name: e, dtype: object

In [111]:
# Boolean Indexing - It is a technique used in Pandas to select the subset of data based on certain conditions. It allows 
# you to filter rows or columns from dataframe using Boolean arrays.
condition=my_df['age']>20
print(condition)
my_df[condition]

a    False
b     True
c     True
d     True
e     True
Name: age, dtype: bool

,name,age,Degree,College,Location
b,Anubhav Yadav,21,B.Tech(Chemical),IET,Lucknow
c,Prakhar Nigam,21,B.Tech(Cyber Security),Chandigarh University,Chandigarh
d,Anand Kumar,23,B.Arch,SDCA,Ghaziabad
e,Ravi Mishra,21,Nursing,Integral University,Lucknow

In [116]:
condition2=my_df['name']
print(condition2)
names=[name for name in condition2 if name[0]=='A']
print(names)

a    Uday Vikram Singh
b        Anubhav Yadav
c        Prakhar Nigam
d          Anand Kumar
e          Ravi Mishra
Name: name, dtype: object
['Anubhav Yadav', 'Anand Kumar']

In [118]:
condition3=my_df['Location']=='Lucknow'
print(condition3)
my_df[condition3]

a     True
b     True
c    False
d    False
e     True
Name: Location, dtype: bool

                name  age            Degree              College Location
a  Uday Vikram Singh   20       B.Tech(CSE)               SRMCEM  Lucknow
b      Anubhav Yadav   21  B.Tech(Chemical)                  IET  Lucknow
e        Ravi Mishra   21           Nursing  Integral University  Lucknow

# Data Transformation

In [119]:
# apply() - Apply a function to each element or row/column
# 0 or index: apply function to each column.
# 1 or columns: apply function to each row.

In [122]:
import numpy as np
my_df.apply(np.sum,axis=0)
# print(my_df.apply(np.sum,axis=1)) -- throws error TypeError: can only concatenate str (not "int") to str

name        Uday Vikram SinghAnubhav YadavPrakhar NigamAna...
age                                                       106
Degree      B.Tech(CSE)B.Tech(Chemical)B.Tech(Cyber Securi...
College     SRMCEMIETChandigarh UniversitySDCAIntegral Uni...
Location             LucknowLucknowChandigarhGhaziabadLucknow
dtype: object

In [127]:
# map(), replace(): Map values using a dictionary or function.
age=my_df['age']
print(age)

age1=my_df['age'].apply(lambda x:x*2)
print(age1)

a    20
b    21
c    21
d    23
e    21
Name: age, dtype: int64
a    40
b    42
c    42
d    46
e    42
Name: age, dtype: int64